packages.dot
digraph "packages" {
charset="utf-8"
rankdir=BT
"0" [label="components", shape="box"];
"1" [label="components.beam", shape="box"];
"2" [label="components.component", shape="box"];
"3" [label="components.cylinder_base", shape="box"];
"4" [label="components.dowel", shape="box"];
"5" [label="components.inside_doc", shape="box"];
"6" [label="components.joint", shape="box"];
"7" [label="components.panel", shape="box"];
"8" [label="components.plate", shape="box"];
"9" [label="components.repository", shape="box"];
"10" [label="components.screw", shape="box"];
"11" [label="components.skeleton_part", shape="box"];
"12" [label="components.threaded_insert", shape="box"];
"13" [label="components.types", shape="box"];
"0" -> "1" [arrowhead="open", arrowtail="none"];
"0" -> "4" [arrowhead="open", arrowtail="none"];
"0" -> "6" [arrowhead="open", arrowtail="none"];
"0" -> "7" [arrowhead="open", arrowtail="none"];
"0" -> "8" [arrowhead="open", arrowtail="none"];
"0" -> "10" [arrowhead="open", arrowtail="none"];
"0" -> "11" [arrowhead="open", arrowtail="none"];
"0" -> "12" [arrowhead="open", arrowtail="none"];
"1" -> "2" [arrowhead="open", arrowtail="none"];
"3" -> "2" [arrowhead="open", arrowtail="none"];
"4" -> "2" [arrowhead="open", arrowtail="none"];
"4" -> "3" [arrowhead="open", arrowtail="none"];
"6" -> "2" [arrowhead="open", arrowtail="none"];
"6" -> "9" [arrowhead="open", arrowtail="none"];
"7" -> "2" [arrowhead="open", arrowtail="none"];
"8" -> "2" [arrowhead="open", arrowtail="none"];
"9" -> "0" [arrowhead="open", arrowtail="none"];
"10" -> "2" [arrowhead="open", arrowtail="none"];
"10" -> "3" [arrowhead="open", arrowtail="none"];
"11" -> "2" [arrowhead="open", arrowtail="none"];
"11" -> "6" [arrowhead="open", arrowtail="none"];
"11" -> "9" [arrowhead="open", arrowtail="none"];
"12" -> "2" [arrowhead="open", arrowtail="none"];
"12" -> "3" [arrowhead="open", arrowtail="none"];
"13" -> "1" [arrowhead="open", arrowtail="none"];
"13" -> "2" [arrowhead="open", arrowtail="none"];
"13" -> "4" [arrowhead="open", arrowtail="none"];
"13" -> "6" [arrowhead="open", arrowtail="none"];
"13" -> "7" [arrowhead="open", arrowtail="none"];
"13" -> "8" [arrowhead="open", arrowtail="none"];
}
